In [1]:
import pandas as pd
import numpy as np

In [13]:
df = pd.DataFrame(np.random.randint(0,10,(3,3)))
df

   0  1  2
0  2  9  3
1  8  1  1
2  0  6  3

In [28]:
df - df.iloc[0]

   0  1  2
0  0  0  0
1  6 -8 -2
2 -2 -3  0

In [36]:
df.subtract(df.iloc[:,0],axis=0)

   0  1  2
0  0  7  1
1  0 -7 -7
2  0  6  3

In [ ]:
# How to handle the missing values

In [38]:
data=pd.Series([2,10,np.nan,20,None])
data

0     2.0
1    10.0
2     NaN
3    20.0
4     NaN
dtype: float64

In [39]:
data.isnull()

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [41]:
data[data.notnull()]

0     2.0
1    10.0
3    20.0
dtype: float64

In [42]:
data.describe()

count     3.000000
mean     10.666667
std       9.018500
min       2.000000
25%       6.000000
50%      10.000000
75%      15.000000
max      20.000000
dtype: float64

In [50]:
df=pd.DataFrame([[2,10,np.nan,20],[2,10,20,None],[2,3,4,3],[2,25,20,None]])
df

   0   1     2     3
0  2  10   NaN  20.0
1  2  10  20.0   NaN
2  2   3   4.0   3.0
3  2  25  20.0   NaN

In [52]:
df.isnull().any()

0    False
1    False
2     True
3     True
dtype: bool

In [46]:
df.describe()

         0          1          2          3
count  4.0   4.000000   3.000000   2.000000
mean   2.0  12.000000  14.666667  11.500000
std    0.0   9.273618   9.237604  12.020815
min    2.0   3.000000   4.000000   3.000000
25%    2.0   8.250000  12.000000   7.250000
50%    2.0  10.000000  20.000000  11.500000
75%    2.0  13.750000  20.000000  15.750000
max    2.0  25.000000  20.000000  20.000000

In [56]:
df

   0   1     2     3
0  2  10   NaN  20.0
1  2  10  20.0   NaN
2  2   3   4.0   3.0
3  2  25  20.0   NaN

In [54]:
df.dropna()

   0  1    2    3
2  2  3  4.0  3.0

In [55]:
df.dropna(axis=1)

   0   1
0  2  10
1  2  10
2  2   3
3  2  25

In [57]:
df.dropna(how="all")

   0   1     2     3
0  2  10   NaN  20.0
1  2  10  20.0   NaN
2  2   3   4.0   3.0
3  2  25  20.0   NaN

In [60]:
df.dropna(thresh=4)

   0  1    2    3
2  2  3  4.0  3.0

In [ ]:
# Filling Value

In [61]:
data

0     2.0
1    10.0
2     NaN
3    20.0
4     NaN
dtype: float64

In [64]:
data.fillna(0)

0     2.0
1    10.0
2     0.0
3    20.0
4     0.0
dtype: float64

In [69]:
data.fillna(method='ffill')

0     2.0
1    10.0
2    10.0
3    20.0
4    20.0
dtype: float64

In [70]:
df.fillna(0)

   0   1     2     3
0  2  10   0.0  20.0
1  2  10  20.0   0.0
2  2   3   4.0   3.0
3  2  25  20.0   0.0

In [71]:
df

   0   1     2     3
0  2  10   NaN  20.0
1  2  10  20.0   NaN
2  2   3   4.0   3.0
3  2  25  20.0   NaN

In [78]:
df.describe()

         0          1          2          3
count  4.0   4.000000   3.000000   2.000000
mean   2.0  12.000000  14.666667  11.500000
std    0.0   9.273618   9.237604  12.020815
min    2.0   3.000000   4.000000   3.000000
25%    2.0   8.250000  12.000000   7.250000
50%    2.0  10.000000  20.000000  11.500000
75%    2.0  13.750000  20.000000  15.750000
max    2.0  25.000000  20.000000  20.000000

In [86]:
a = df.mean().mean() #df.stack.mean()

In [87]:
df.fillna(a)

   0   1          2          3
0  2  10  10.041667  20.000000
1  2  10  20.000000  10.041667
2  2   3   4.000000   3.000000
3  2  25  20.000000  10.041667

In [88]:
df.mean()

0     2.000000
1    12.000000
2    14.666667
3    11.500000
dtype: float64

In [89]:
df.fillna(df.mean())

   0   1          2     3
0  2  10  14.666667  20.0
1  2  10  20.000000  11.5
2  2   3   4.000000   3.0
3  2  25  20.000000  11.5

In [93]:
df.fillna(method="ffill")

   0   1     2     3
0  2  10   NaN  20.0
1  2  10  20.0  20.0
2  2   3   4.0   3.0
3  2  25  20.0   3.0

In [94]:
df.fillna(method="bfill")

   0   1     2     3
0  2  10  20.0  20.0
1  2  10  20.0   3.0
2  2   3   4.0   3.0
3  2  25  20.0   NaN

In [95]:
df.fillna(method="ffill",axis=1)

     0     1     2     3
0  2.0  10.0  10.0  20.0
1  2.0  10.0  20.0  20.0
2  2.0   3.0   4.0   3.0
3  2.0  25.0  20.0  20.0

In [98]:
df1= pd.DataFrame(np.random.randint(0,10,(3,3)),columns=list('PQR'))
df2 = pd.DataFrame(np.random.randint(0,10,(3,3)),columns=list('PQR'))

In [101]:
pd.concat([df1,df2], axis=1, ignore_index=True)

   0  1  2  3  4  5
0  8  6  2  9  5  8
1  4  3  9  4  4  8
2  8  1  0  3  3  1

In [102]:
df1= pd.DataFrame(np.random.randint(0,10,(3,3)),columns=list('PQR'))
df2 = pd.DataFrame(np.random.randint(0,10,(3,4)),columns=list('PRTM'))

In [105]:
pd.concat([df1,df2], axis=1,ignore_index=True)

   0  1  2  3  4  5  6
0  9  4  5  3  7  0  6
1  3  2  0  6  2  2  6
2  8  8  0  0  6  2  0

In [111]:
pd.concat([df1,df2], axis=0,join='inner')

   P  R
0  9  5
1  3  0
2  8  0
0  3  7
1  6  2
2  0  6

In [ ]:
# merging operation

In [139]:
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})
right = pd.DataFrame(
   {'id':[1,2,3,4,5],
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5']})

In [141]:
print(pd.merge(left,right,on='id'))

   id  Name_x subject_id_x Name_y subject_id_y
0   5  Ayoung         sub5  Billy         sub2

In [127]:
pd.merge(left,right,on='Name',how='inner')

Empty DataFrame
Columns: [id_x, Name, subject_id_x, id_y, subject_id_y]
Index: []

In [146]:
a=  pd.merge(left,right,on='Name',how='left')
b= a.drop('id_y',axis=1)
print(b)

   id_x    Name subject_id_x subject_id_y
0     1    Alex         sub1          NaN
1     2     Amy         sub2          NaN
2     3   Allen         sub4          NaN
3     4   Alice         sub6          NaN
4     5  Ayoung         sub5          NaN

In [130]:
pd.merge(left,right,on='Name',how='right')

   id_x   Name subject_id_x  id_y subject_id_y
0   NaN  Billy          NaN     1         sub2
1   NaN  Brian          NaN     2         sub4
2   NaN   Bran          NaN     3         sub3
3   NaN  Bryce          NaN     4         sub6
4   NaN  Betty          NaN     5         sub5

In [133]:
pd.merge(left,right,on='Name',how='outer')

   id_x    Name subject_id_x  id_y subject_id_y
0   1.0    Alex         sub1   NaN          NaN
1   2.0     Amy         sub2   NaN          NaN
2   3.0   Allen         sub4   NaN          NaN
3   4.0   Alice         sub6   NaN          NaN
4   5.0  Ayoung         sub5   NaN          NaN
5   NaN   Billy          NaN   1.0         sub2
6   NaN   Brian          NaN   2.0         sub4
7   NaN    Bran          NaN   3.0         sub3
8   NaN   Bryce          NaN   4.0         sub6
9   NaN   Betty          NaN   5.0         sub5

In [ ]:
# left_on and #right_on if we have different columns

In [148]:
pd.merge(left,right,on='Name',suffixes=('DM','Network'))

Empty DataFrame
Columns: [idDM_, Name, subject_idDM_, idNetwork_, subject_idNetwork_]
Index: []

In [ ]:
# how to read csv 
pd.read_csv()